basic/vm-benchmarks/results/virtaulbox/results/io_test.txt
--- IOZone local filesystem test ---
	Iozone: Performance Test of File I/O
	        Version $Revision: 3.489 $
		Compiled for 64 bit mode.
		Build: linux-AMD64 

	Contributors:William Norcott, Don Capps, Isom Crawford, Kirby Collins
	             Al Slater, Scott Rhine, Mike Wisner, Ken Goss
	             Steve Landherr, Brad Smith, Mark Kelly, Dr. Alain CYR,
	             Randy Dunlap, Mark Montague, Dan Million, Gavin Brebner,
	             Jean-Marc Zucconi, Jeff Blomberg, Benny Halevy, Dave Boone,
	             Erik Habbinga, Kris Strecker, Walter Wong, Joshua Root,
	             Fabrice Bacchella, Zhenghua Xue, Qin Li, Darren Sawyer,
	             Vangel Bojaxhi, Ben England, Vikentsi Lapa,
	             Alexey Skidanov, Sudhir Kumar.

	Run began: Wed Apr 30 15:12:59 2025

	Auto Mode
	Command line used: iozone -a
	Output is in kBytes/sec
	Time Resolution = 0.000001 seconds.
	Processor cache size set to 1024 kBytes.
	Processor cache line size set to 32 bytes.
	File stride size set to 17 * record size.
                                                              random    random     bkwd    record    stride                                    
              kB  reclen    write  rewrite    read    reread    read     write     read   rewrite      read   fwrite frewrite    fread  freread
              64       4  1204796  2662899  6421025  5735102  7100397  1526887  3738358    955947   9006179  3738358  3958892  4988978 15972885
              64       8  1279447  4274062 15972885 12902017 15972885  2892445  3738358   1363961  10821524  4018152  3791156  9318832 10821524
              64      16  1518251  3057153 20962191  5283570 12310336  3958892  7940539   5283570  12902017  1363961  4897948 12902017  7940539
              64      32  1421755  3363612 20962191 15972885  9318832  4018152  7940539   5735102  12902017  3791156  7100397 16983463 20962191
              64      64  1828508  5860307 20962191 34389688 22737791  3958892  7100397   4988978   5860307  5735102  3791156 15972885 15972885
             128       4  1406136  4407601 14200794 10567140  9795896  3895854  8036304   2326073   2326073  3297617  4267461 11720614 12842051
             128       8  1778862  5545860  9795896 11720614 15881078  4889281  9795896   7582312   7476717  4407601  4934216  8548124 12842051
             128      16  1684006  6406138 15881078 12842051 14200794  4267461  8548124   5784891  12842051  3657016  4934216 15881078 21643049
             128      32  1852520  7176872  9129573 12842051  9129573  6406138  6727225   7476717   2248149  2558895  7476717 18012359 21643049
             128      64  1939522  7176872 15881078 18637664 18012359  6727225 10779307   8036304  11720614  2166499  8414153 14200794 21643049
             128     128  1939522  6727225 16365173 25804035 18637664  4759253 11470204   2409592  11470204  6812590  7476717 16365173 18637664
             256       4  1570244  4477549 10245071  8534922  7735574  3605511  6398720   5117791   9114515  3605511  3823789 10651598  9434868
             256       8  1814348  5022044 17096249 11695808 14953435  4332998 10651598   6554972  13454450  4350555  4197489 11695808 13454450
             256      16  1938842  6073004 14164395 12228612 14164395  5320671  9518507   8534922  16072608  4652146  6107548 14953435 12812277
             256      32  1868008  6761355 14353744 14164395 16828306  6719046 14953435   4572895  21134280  3770085  6554972 15835569 13454450
             256      64  2081678  6936061 17096249 15164624 21134280  6398720  4998665   4197489  18259146  3368013  8534922 15164624 21134280
             256     128  2205688  8024634  5428265 19591792 21558614  7073132 11207494   4132864  19591792  5117791  7735574 14353744 14164395
             256     256  2061693  5938650  7120034 14353744 12812277  5117791 17096249   5242734  13454450  6398720  8534922 19955913 23441229
             512       4  1801873  5177083  8394979  7022379  4784885  3140488  7758090   5968453   9681823  3029721  3768799 10911694 12797441
             512       8  1867692  5331314 15930214 12215097 10434519  4871723 10641343   6821616  10434519  3325278  4494470 12499490 13438092
             512      16  1947291  5019764 16543832  8265729  9107004  4228947  6571132   5019764   8665997  4228947  3459188  8394979  8808176
             512      32  2216629  6931711 20490142 15037801 19736867  6395018 15037801   6551087  23139567  4690818  5115422 19037014 22183443
             512      64  2275345  7022379 15471149 16417355 20490142  6246213 15037801  10235583  17630404  6491676  5639315 10434519 15930214
             512     128  2416145  5278892 11877300 17069844 15471149  7022379  7513788   7435738  22183443  7022379  7211022  6491676 12797441
             512     256  1662389  7091952  8265729  9859630 10044089  5019764 11374040   5951911  10856530  4610256  8665997 14628067 11620224
             512     512  2105777  7334159  9468384 13438092 17630404  4961773  5951911   4927617  15930214  7211022  7988981 21303197 23391616
            1024       4  1841906  4215688  8525047  9655828  5821271  4392454  8895850   4211554   9381637  4146499  4048778  8680108 12173747
            1024       8  2015654  6128613 10557785 12639479  7008693  5853003  8988941   6137371  12492426  3447541  4876180 13142265 10230845
            1024      16  2016600  6244448 13142265  9142007  5751117  4451639 11278631   4848656   9320560  4470172  5720477 14183905 11278631
            1024      32  2056183  6280976 10230845  8593274  6402699  5623115 13142265  10329265  14618393  6093831  6280976 13998981 20869039
            1024      64  2316837  7755368 16789959 14618393 17056672  7524394  7420395  10230845  21823389  6874084  7420395 18291580 20088179
            1024     128  2503178  7869040 19020633 15240881 21713061  8061038  9743447  10557785  21388672  6025439  7485055  9064828 17688906
            1024     256  2565989  8474583 17056672 15977962 14668318  8000971 13305116   6128613  20471166  8199542  9142007 11278631 20970936
            1024     512  2375790  8262639 17331995 17056672 13998981  8326715 17056672   7420395  21282686  6441107 12790037 19363647 21388672
            1024    1024  1777861  7160597 12983353 16531459 19629138  7811791 15801608   7811791  17616353  7811791  7883484 10662628 20471166
            2048       4  1754908  4764758  8261095  8903279  6397004  4240255  8643474   6464402   7670915  3792790  4046500 10503637 11202231
            2048       8  1969352  4983122 12118884 11246230  8423109  5447681 12118884   7082696  10726615  4842658  4900677 13748169 16367837
            2048      16  2131071  4807425 10555264 10037248  8292998  5970183  9400176   8531869  11440955  4319142  4196751 12187663 13859076
            2048      32  2245848  6563185 12959958 13301113 10889797  6851089 15854271   8464610  16783585  6321679  6225466 15623582 18641120
            2048      64  2412357  7112016 17221003 14613561 11626784  8190205 17186548   8498106  13467949  7444871  7183386 12118884 20461691
            2048     128  2350955  6780783 15289867 13552946 10452512  7042051 15048789  10401883  18441025  5507054  6629029 15154989 13219235
            2048     256  2324867  7059413 16001943 12786337 11001372  7451329 15510737   7911115  10555264  5738844  7207495 16367837 17828628
            2048     512  2316716  6303124 16525279 14638464  9015410  8029434 17186548   8634786  17186548  7670915  8820994 18129656 21325256
            2048    1024  2350955  7393606 13949098 15510737 11579763  7670915 14944066   9062970  17501701  5020987 11187641 15289867 17645509
            2048    2048  2250555  5345969 11564174 18600754 11305435  7726111 15399510   7503399  16653431  7643611  7582884 15289867 19710468
            4096       4  1786256  4576653  7405736  8142867  6245395  3953206  7585581   5719367   8047509  3889659  3949571  8712759 10400659
            4096       8  2045026  5894001 11704457 10867793  9100443  5424983  9779037   8695120  11252164  4917236  4763181  9435311 14165392
            4096      16  2321978  6151473 11539362 12151506 10745439  6361016  9658092   9989424  11099499  5299475  5355645 14130439 15452222
            4096      32  2280370  5928578 11609543 11070889 12299398  6780263 13702178  10502389  13572279  6321227  6142675 13518879 16996213
            4096      64  2297140  6727163 15452222 12532680 12264277  7502762 14026607   9227530  11907264  6542703  6714018 14686087 16912554
            4096     128  2491711  7656576 13615304 12832234 12370246  7486415 13423810  11477688  16650294  6625976  6503078 11164417 14366773
            4096     256  2401165  6815229 14475721 12117223 11874344  7314299 15273632  10419583  20359982  6195843  6311938 14318876 14889742
            4096     512  2464545  6693092 14787213 12151506 13046624  7642951 15112405   9658092  19774121  6649056  6703539 12299398 16058868
            4096    1024  2467731  7212959 14524675 13381985 13834587  7670249 11477688   8824645  19865582  6828774  6562698 12229356 16585996
            4096    2048  2388147  6370451 10752164 13980948 13299112  7555557 13834587   8043741  12997272  5440445  8409937 12308209 14427096
            4096    4096  2198655  6005255  9188050 15165768 11874344  6897314 11907264   6595451  12264277  6490793  7073381 11601703 13561566
            8192       4  1733781  3683582  7179509  7816482  6832584  3982442  6748045   5809106   7243074  3820802  3489075  7816482  9571475
            8192       8  2103725  5382328  9682056  9030615  8549738  4617744  9638600   8376734   9153307  4528283  4339005  9505279 11178240
            8192      16  2086606  5531360  9859872  9558162  9547539  4982701  9299470   9194949  11442544  4905166  4558925 10569606 12698523
            8192      32  2283220  6196743 11236730 10950244 11116757  6042010 10356163   9871202  13085407  5693594  5638469 10936302 13816816
            8192      64  2339178  6698058 11636301 10543659 12099327  6220301 10612044  11027561  13236637  5868638  5830794 10501766 14659806
            8192     128  2314129  6305921 11378128 10950244 11997929  6596471 12048414  10251112  13889424  5876668  5923270 10908526 13957128
            8192     256  2349254  6085887 10877445 10867125 11993741  6350207 10778492   9820419  13652121  5490700  5785631 11070196 14170099
            8192     512  2388945  6090202 11554130 10778492 12189466  6281710 10981742   9204802  17622134  5688881  5712526 10724663 13789092
            8192    1024  2172905  5653313 11804201 10819219 11939561  6010303 11024023   7983571  15137744  4836126  5347148 11314434 13065504
            8192    2048  2340453  6104267 11222050 11427322 12582271  6538726 10748147   7649426  12740902  5053790  5392464  9416708 12679779
            8192    4096  2246350  5472336  9627797 10936302 13539152  5847664 10015063   5940679  11113162  4322629  5414558  7097937  8808369
            8192    8192  2064043  4727012  6611703 10460204 10724663  5053790  7124429   5101058   8096444  4992112  4754484  7749491  7970607
           16384       4  1663716  3433432  7973201  7288248  5990815  3415513  6088478   6272998   6814835  3458139  3191829  7724930  8329829
           16384       8  1880417  4027679  9654587  8967926  7972276  4005844  8204521   8307675   8691180  3908556  3597726  8992570  9787975
           16384      16  1929574  3894380 10008945  8938763  9022086  4145769  8715430   9580557  10003117  3748238  3782069 10063176 11207053
           16384      32  2039831  4556146 10569291  9984224  9515553  4115479  8632226   9700926   9700926  3924404  3759516 10530420 11553752
           16384      64  2085264  4533603 10290727  9552590 10892628  4776562 11025448   9845471  11620178  4946763  4637315 10674363 13256568
           16384     128  2192442  4776894 10829117  9810333 11069849  4943916 10144884   9245428  13203082  4930791  4958542 11457436 13147509
           16384     256  2191253  4673266 11497692 10337166 11932938  5142593 11229029  10082370  12993382  5221128  5271594 11579060 13320811
           16384     512  2347954  4589312 11402305 10252345 12217217  5067880 10680999   8952737  12790240  4756066  4558564 10764656 12983563
           16384    1024  2148100  4679950 11041391  9895089 12073405  4892178 10894355   8507196  19839298  4434142  4318230 10214248 12497164
           16384    2048  2113482  4890437 10190014 10337166 12533633  5107050  9442334   7004468  18553747  4373747  4097077  9210731 11941233
           16384    4096  2066825  4344712  7899874  9481418 12154552  4915624  7677462   6115570  13849691  4354072  4492406  8094352 10461487
           16384    8192  2082609  4613963  7025952  8099122 10232499  4611486  7073685   4586862   8329829  3946037  5066386  6753885  7805655
           16384   16384  2085011  4063642  5931862  7857420  8324784  4089031  6806735   4023669   6633278  4160327  3946944  6387277  6884473
           32768      64  2003050  4556872 12459557 10422459 11984764  3989773 11578871  11448661  11787413  4389645  4210261 11824937 12435882
           32768     128  2064366  4163705 12308915 10104463 11928594  4150503 11283239  10735903  11783371  4575227  3880614 11558422 12574693
           32768     256  2029104  4178008 11972236 10275190 12464076  4433542 11393614   9761424  11126132  4218920  4392591 11425818 12459557
           32768     512  2150850  4131538 11719068  9498327 11686185  4098519 11122530   9723441  12249673  4434114  4265004 12145750 12455040
           32768    1024  2015357  4149876 11834101  9863705 12501490  4432970 10732550   8916613  12268261  4323501  4268316  8471437 12434757
           32768    2048  2170929  4129552 11122530 11074136 13659472  4521642 10502903   8498151  20606140  3992671  3873286  9140777 13002978
           32768    4096  2222140  4158917  7625835  9454549 12272643  4212325  7719205   6270080  13107142  3790394  3827657 10618945 13097150
           32768    8192  2171787  3583543  7047137  8438668 11980585  4296335  6411354   5116138   8423669  4372051  3621216  6226054  8404609
           32768   16384  2275712  3579250  5923376  7688545  8557946  4610682  6259514   4640103   5958041  4443145  5614839  5540819  7363929
           65536      64  2050749  4121490 14278032 11279908 12700659  3884991 11256812  11543765  11937300  4038176  3907468 12715347 13067765
           65536     128  1679887  3891866 11970050 10178097 12339751  4018165 11948197  11528273  12757838  4624008  4542925 13796455 15170862
           65536     256  2286765  3894679 11401556 10425940 14283968  4204002 11619891  11719970  13054732  4621054  4381585 12210931 14877722
           65536     512  2623761  4054198 11081639 10656327 14770595  4435316 11200850  12822708  13636301  4460362  4359210 12386459 14438528
           65536    1024  2427074  3975509 11060681 10475607 14567076  4544803 11893912   9517338  13104521  4385430  4496479 10802059 11753043
           65536    2048  2677769  4292029 11181714 10340051 12637015  4093685  9940326   7913160  12552760  3833839  3737201  9857976 12512191
           65536    4096  2140930  3821793  8877680  9859744 12468489  3928353  7579116   6894906  15355616  3587041  3699677  7550179 11818737
           65536    8192  2075571  3656127  6787141  8544593 11197200  3808871  6480248   5205842  10330724  3496738  3354427  6672311  8986225
           65536   16384  2099766  3478947  6358380  6727836  8651629  3461467  5970310   5269009   6355881  4297733  3948214  6120801  7467721
          131072      64  1929510  4072965 12625060 10026952 11826570  3649302 11602432  10468188  11424493  4291520  3909797 12823846 12890600
          131072     128  2096617  4158899 13181125 10579794 13154316  3830495 12380547   9250662  12935185  4372726  4447042 12931534 13333941
          131072     256  2212369  3650514 12432062  9830619 12853830  3854937 11183717   9496591  12037093  4502327  4433521 12690927 12840020
          131072     512  2219040  3748663 11950484  9662501 12230165  3791058 11903906  10048395  12584888  4337843  4280193 12340805 12727948
          131072    1024  2291510  3724688 12053720  9989601 12822650  3918324 11874594   9997958  13330061  4268628  4041466 11837010 12686241
          131072    2048  2207714  3704908 11576778 10102684 12936403  3891806 10903568   9080898  12821154  3743507  3889025 12036039 14508567
          131072    4096  2243344  3710359 10667453 10414841 12648297  3846011 11187358   8450266  12926365  3667880  3885095 11325642 14830685
          131072    8192  2244810  3619867 11687034 10836725 13696025  3726506  7821385   6920407  10966426  3589238  3800834  7789910 12563318
          131072   16384  2353973  3728932  9005185  9495934  9584673  3759944  6734001   5376384   6576671  3565702  3716027  6315852  7880695
          262144      64  1979223  3994755 12459365  9842482 11943319  3599741 11445877  11303149  12375921  4216229  4026293 11883168 12416872
          262144     128  2067350  4114772 13107867 10698468 12877888  3923733 11974928  11148881  12126279  4547329  4314486 11866496 12121199
          262144     256  2189090  3911491 12425572  9859870 12259458  3891913 11972711  10590780  12314103  4446139  4876449 13088207 13560187
          262144     512  2182498  3970376 11493496 11324686 11754352  3747383 12364648  10649765  11628545  4225676  4063794 10566557 11808255
          262144    1024  2009198  3554496 10202598  8417197 10199380  3668648 10896415   9553012  11269667  3953914  3452125 10853927 12097061
          262144    2048  2133297  3400146 12106651 10199758 12246758  3352181 11755860  10192572  11079117  3420232  4077584 11744810 14041611
          262144    4096  2087798  3836440 12289329 11772223 13023869  3422020 10834675   8968005  10502967  3088847  3651130 10697531 12267528
          262144    8192  2053178  3806147 11514681  9001263 11120465  3436330 11658508   6718357  10891774  3154487  3341200  9760006 11582852
          262144   16384  2044150  3358150  8527258  6128902  7542845  3507786  7740161   5330505   7421770  3364182  3578710  7250954  9542565
          524288      64  1658052  3467102 11201286  9522309 11110621  3154689 10911761  11196496  10843587  3869627  3996706 12869433 13042934
          524288     128  1750246  3970826 12015023 10111809 11684327  2654863 11066283   9249472  11599826  3267101  3368922 12225774 12316780
          524288     256  1887319  3181301 11482442  9251924 10563298  2651362 12123658  10424885  11278441  4128126  4233899 13647949 12849279
          524288     512  2045300  3772286 11690850  9746587 11562195  3544594 11388898  11378291  12630674  4192594  3658874 11178112 12705402
          524288    1024  2037802  3368659 11981831  9438118 12125396  3550328 11947395  10407271  12308989  3845106  3926134 12211720 12623424
          524288    2048  1812239  3709410 11939481  9617344 12275252  3647471 11071910   9606379  11928665  3665406  4152643 12227678 13158836
          524288    4096  1942519  3899766 11614162  9958000 12739629  3581979 11642077   9604491  12186208  3393471  3545817 11093022 12289041
          524288    8192  1654301  3578290 11042055  9828967 12507184  3359032  9945524   7704792  11946875  3303266  3043635  9879751 12283892
          524288   16384  1743118  3670735  9588828  8496020 10115344  3378929  8141129   5745118   6005244  2804787  3325747  8029887  8876772

iozone test complete.

--- FIO local I/O test ---
mytest: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.16
Starting 16 processes
mytest: Laying out IO file (1 file / 1024MiB)
mytest: Laying out IO file (1 file / 1024MiB)
mytest: Laying out IO file (1 file / 1024MiB)
[...]

mytest: (groupid=0, jobs=1): err= 0: pid=217412: Wed Apr 30 15:14:32 2025
  write: IOPS=1901, BW=7605KiB/s (7788kB/s)(74.7MiB/10062msec); 0 zone resets
    slat (nsec): min=1423, max=208008k, avg=521460.74, stdev=8420706.86
    clat (nsec): min=151, max=36006k, avg=2310.61, stdev=260319.91
     lat (nsec): min=1653, max=208010k, avg=523869.89, stdev=8424812.44
    clat percentiles (nsec):
     |  1.00th=[   191],  5.00th=[   231], 10.00th=[   241], 20.00th=[   262],
     | 30.00th=[   310], 40.00th=[   350], 50.00th=[   370], 60.00th=[   410],
     | 70.00th=[   430], 80.00th=[   442], 90.00th=[   462], 95.00th=[   482],
     | 99.00th=[  2192], 99.50th=[  5856], 99.90th=[  7776], 99.95th=[ 12992],
     | 99.99th=[124416]
   bw (  KiB/s): min=  344, max=126656, per=7.95%, avg=7650.90, stdev=28023.01, samples=20
   iops        : min=   86, max=31664, avg=1912.60, stdev=7005.78, samples=20
  lat (nsec)   : 250=11.72%, 500=84.09%, 750=2.68%, 1000=0.20%
  lat (usec)   : 2=0.27%, 4=0.30%, 10=0.67%, 20=0.04%, 50=0.03%
  lat (usec)   : 250=0.01%
  lat (msec)   : 50=0.01%
  cpu          : usr=0.42%, sys=0.52%, ctx=98, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19131,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217413: Wed Apr 30 15:14:32 2025
  write: IOPS=993, BW=3975KiB/s (4070kB/s)(38.0MiB/10037msec); 0 zone resets
    slat (nsec): min=1332, max=293994k, avg=997238.33, stdev=11764314.42
    clat (nsec): min=160, max=16026k, avg=2276.46, stdev=160955.18
     lat (nsec): min=1613, max=293998k, avg=999668.74, stdev=11765501.29
    clat percentiles (nsec):
     |  1.00th=[     191],  5.00th=[     241], 10.00th=[     270],
     | 20.00th=[     322], 30.00th=[     350], 40.00th=[     382],
     | 50.00th=[     410], 60.00th=[     430], 70.00th=[     442],
     | 80.00th=[     450], 90.00th=[     490], 95.00th=[     604],
     | 99.00th=[    3792], 99.50th=[    6496], 99.90th=[   14656],
     | 99.95th=[   25216], 99.99th=[16056320]
   bw (  KiB/s): min=  283, max=52656, per=4.14%, avg=3984.15, stdev=11473.32, samples=20
   iops        : min=   70, max=13164, avg=995.85, stdev=2868.38, samples=20
  lat (nsec)   : 250=5.65%, 500=85.25%, 750=5.63%, 1000=1.10%
  lat (usec)   : 2=0.88%, 4=0.51%, 10=0.81%, 20=0.09%, 50=0.02%
  lat (usec)   : 500=0.02%
  lat (msec)   : 2=0.01%, 20=0.01%
  cpu          : usr=0.08%, sys=0.50%, ctx=151, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9974,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217414: Wed Apr 30 15:14:32 2025
  write: IOPS=1935, BW=7742KiB/s (7928kB/s)(75.0MiB/10046msec); 0 zone resets
    slat (nsec): min=1312, max=206257k, avg=513886.17, stdev=8447134.13
    clat (nsec): min=160, max=16025k, avg=1283.50, stdev=114928.99
     lat (nsec): min=1563, max=206262k, avg=515275.04, stdev=8448071.79
    clat percentiles (nsec):
     |  1.00th=[   191],  5.00th=[   231], 10.00th=[   251], 20.00th=[   310],
     | 30.00th=[   342], 40.00th=[   350], 50.00th=[   382], 60.00th=[   410],
     | 70.00th=[   430], 80.00th=[   442], 90.00th=[   462], 95.00th=[   540],
     | 99.00th=[  2192], 99.50th=[  5792], 99.90th=[  8768], 99.95th=[ 17792],
     | 99.99th=[171008]
   bw (  KiB/s): min=  360, max=126864, per=8.08%, avg=7777.05, stdev=28047.39, samples=20
   iops        : min=   90, max=31716, avg=1944.20, stdev=7011.86, samples=20
  lat (nsec)   : 250=8.43%, 500=84.85%, 750=4.33%, 1000=0.84%
  lat (usec)   : 2=0.49%, 4=0.27%, 10=0.70%, 20=0.04%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 20=0.01%
  cpu          : usr=0.17%, sys=0.81%, ctx=92, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19445,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217415: Wed Apr 30 15:14:32 2025
  write: IOPS=1490, BW=5960KiB/s (6103kB/s)(59.1MiB/10157msec); 0 zone resets
    slat (nsec): min=1452, max=383697k, avg=667227.89, stdev=9970074.78
    clat (nsec): min=160, max=10184k, avg=1106.79, stdev=82787.13
     lat (nsec): min=1683, max=383700k, avg=668440.77, stdev=9970574.77
    clat percentiles (nsec):
     |  1.00th=[  181],  5.00th=[  231], 10.00th=[  251], 20.00th=[  302],
     | 30.00th=[  342], 40.00th=[  370], 50.00th=[  402], 60.00th=[  422],
     | 70.00th=[  430], 80.00th=[  442], 90.00th=[  450], 95.00th=[  482],
     | 99.00th=[ 1784], 99.50th=[ 5792], 99.90th=[ 9792], 99.95th=[13376],
     | 99.99th=[49920]
   bw (  KiB/s): min=  200, max=98528, per=6.28%, avg=6049.00, stdev=21776.67, samples=20
   iops        : min=   50, max=24632, avg=1512.10, stdev=5444.20, samples=20
  lat (nsec)   : 250=8.68%, 500=87.43%, 750=2.40%, 1000=0.25%
  lat (usec)   : 2=0.30%, 4=0.33%, 10=0.52%, 20=0.06%, 50=0.03%
  lat (msec)   : 20=0.01%
  cpu          : usr=0.18%, sys=0.54%, ctx=96, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15134,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217416: Wed Apr 30 15:14:32 2025
  write: IOPS=1047, BW=4190KiB/s (4291kB/s)(41.2MiB/10078msec); 0 zone resets
    slat (nsec): min=1393, max=223560k, avg=946809.34, stdev=11291997.41
    clat (nsec): min=160, max=1603.4k, avg=702.59, stdev=16676.64
     lat (nsec): min=1683, max=223563k, avg=947615.49, stdev=11292400.22
    clat percentiles (nsec):
     |  1.00th=[   191],  5.00th=[   241], 10.00th=[   282], 20.00th=[   322],
     | 30.00th=[   350], 40.00th=[   370], 50.00th=[   390], 60.00th=[   430],
     | 70.00th=[   442], 80.00th=[   450], 90.00th=[   482], 95.00th=[   548],
     | 99.00th=[  2640], 99.50th=[  6112], 99.90th=[ 12224], 99.95th=[ 39680],
     | 99.99th=[552960]
   bw (  KiB/s): min=  589, max=60904, per=4.38%, avg=4220.65, stdev=13351.61, samples=20
   iops        : min=  147, max=15226, avg=1055.05, stdev=3337.93, samples=20
  lat (nsec)   : 250=5.43%, 500=87.17%, 750=4.36%, 1000=1.08%
  lat (usec)   : 2=0.70%, 4=0.42%, 10=0.70%, 20=0.07%, 50=0.04%
  lat (usec)   : 250=0.02%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=0.15%, sys=0.42%, ctx=126, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10557,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217417: Wed Apr 30 15:14:32 2025
  write: IOPS=2368, BW=9475KiB/s (9702kB/s)(93.2MiB/10069msec); 0 zone resets
    slat (nsec): min=1172, max=407747k, avg=421294.47, stdev=7796403.73
    clat (nsec): min=150, max=32511, avg=379.35, stdev=582.61
     lat (nsec): min=1393, max=407750k, avg=421760.07, stdev=7796605.23
    clat percentiles (nsec):
     |  1.00th=[  181],  5.00th=[  221], 10.00th=[  231], 20.00th=[  251],
     | 30.00th=[  270], 40.00th=[  302], 50.00th=[  330], 60.00th=[  350],
     | 70.00th=[  362], 80.00th=[  430], 90.00th=[  442], 95.00th=[  470],
     | 99.00th=[ 1736], 99.50th=[ 5024], 99.90th=[ 7200], 99.95th=[10432],
     | 99.99th=[17024]
   bw (  KiB/s): min=   32, max=166992, per=9.91%, avg=9538.40, stdev=37065.53, samples=20
   iops        : min=    8, max=41748, avg=2384.55, stdev=9266.39, samples=20
  lat (nsec)   : 250=19.26%, 500=78.12%, 750=1.41%, 1000=0.08%
  lat (usec)   : 2=0.21%, 4=0.31%, 10=0.57%, 20=0.05%, 50=0.01%
  cpu          : usr=0.17%, sys=0.84%, ctx=97, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,23851,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217418: Wed Apr 30 15:14:32 2025
  write: IOPS=930, BW=3724KiB/s (3813kB/s)(36.8MiB/10107msec); 0 zone resets
    slat (nsec): min=1393, max=407737k, avg=1065244.48, stdev=12799179.67
    clat (nsec): min=170, max=81984, avg=492.19, stdev=1323.33
     lat (nsec): min=1663, max=407741k, avg=1065850.94, stdev=12799508.61
    clat percentiles (nsec):
     |  1.00th=[  201],  5.00th=[  251], 10.00th=[  282], 20.00th=[  330],
     | 30.00th=[  350], 40.00th=[  390], 50.00th=[  410], 60.00th=[  430],
     | 70.00th=[  442], 80.00th=[  450], 90.00th=[  482], 95.00th=[  564],
     | 99.00th=[ 2640], 99.50th=[ 6432], 99.90th=[13632], 99.95th=[24960],
     | 99.99th=[82432]
   bw (  KiB/s): min=   32, max=54456, per=3.91%, avg=3760.25, stdev=11951.36, samples=20
   iops        : min=    8, max=13614, avg=939.95, stdev=2987.86, samples=20
  lat (nsec)   : 250=4.04%, 500=87.72%, 750=5.22%, 1000=1.05%
  lat (usec)   : 2=0.62%, 4=0.50%, 10=0.68%, 20=0.12%, 50=0.04%
  lat (usec)   : 100=0.01%
  cpu          : usr=0.00%, sys=0.51%, ctx=102, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,9409,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217419: Wed Apr 30 15:14:32 2025
  write: IOPS=1863, BW=7453KiB/s (7632kB/s)(73.4MiB/10081msec); 0 zone resets
    slat (nsec): min=1423, max=406189k, avg=533741.39, stdev=8945862.24
    clat (nsec): min=151, max=28039k, avg=1896.40, stdev=204583.38
     lat (nsec): min=1653, max=406193k, avg=535730.64, stdev=8948285.33
    clat percentiles (nsec):
     |  1.00th=[  181],  5.00th=[  231], 10.00th=[  241], 20.00th=[  251],
     | 30.00th=[  290], 40.00th=[  330], 50.00th=[  362], 60.00th=[  402],
     | 70.00th=[  422], 80.00th=[  430], 90.00th=[  450], 95.00th=[  470],
     | 99.00th=[ 1848], 99.50th=[ 5344], 99.90th=[ 8160], 99.95th=[11840],
     | 99.99th=[22144]
   bw (  KiB/s): min=   32, max=127104, per=7.80%, avg=7510.45, stdev=28159.65, samples=20
   iops        : min=    8, max=31776, avg=1877.45, stdev=7039.95, samples=20
  lat (nsec)   : 250=16.09%, 500=80.94%, 750=1.67%, 1000=0.09%
  lat (usec)   : 2=0.27%, 4=0.32%, 10=0.56%, 20=0.05%, 50=0.01%
  lat (msec)   : 50=0.01%
  cpu          : usr=0.05%, sys=0.78%, ctx=90, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18784,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217420: Wed Apr 30 15:14:32 2025
  write: IOPS=1393, BW=5573KiB/s (5707kB/s)(54.6MiB/10037msec); 0 zone resets
    slat (nsec): min=1503, max=407756k, avg=712516.38, stdev=10494879.16
    clat (nsec): min=160, max=220534, avg=475.83, stdev=2185.23
     lat (nsec): min=1743, max=407760k, avg=713094.83, stdev=10495359.93
    clat percentiles (nsec):
     |  1.00th=[  201],  5.00th=[  241], 10.00th=[  270], 20.00th=[  302],
     | 30.00th=[  330], 40.00th=[  382], 50.00th=[  402], 60.00th=[  422],
     | 70.00th=[  430], 80.00th=[  442], 90.00th=[  462], 95.00th=[  490],
     | 99.00th=[ 2384], 99.50th=[ 6240], 99.90th=[14144], 99.95th=[23680],
     | 99.99th=[82432]
   bw (  KiB/s): min=   32, max=91544, per=5.80%, avg=5588.25, stdev=20239.36, samples=20
   iops        : min=    8, max=22886, avg=1396.95, stdev=5059.87, samples=20
  lat (nsec)   : 250=5.51%, 500=90.00%, 750=2.70%, 1000=0.30%
  lat (usec)   : 2=0.41%, 4=0.27%, 10=0.69%, 20=0.06%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.19%, sys=0.52%, ctx=90, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,13984,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217421: Wed Apr 30 15:14:32 2025
  write: IOPS=1876, BW=7504KiB/s (7684kB/s)(74.4MiB/10157msec); 0 zone resets
    slat (nsec): min=1463, max=409880k, avg=531359.96, stdev=9149842.78
    clat (nsec): min=160, max=9214.6k, avg=1119.67, stdev=72907.28
     lat (nsec): min=1733, max=409883k, avg=532576.35, stdev=9150286.71
    clat percentiles (nsec):
     |  1.00th=[    181],  5.00th=[    231], 10.00th=[    251],
     | 20.00th=[    290], 30.00th=[    330], 40.00th=[    350],
     | 50.00th=[    390], 60.00th=[    410], 70.00th=[    422],
     | 80.00th=[    442], 90.00th=[    450], 95.00th=[    470],
     | 99.00th=[   1912], 99.50th=[   5920], 99.90th=[   8160],
     | 99.95th=[  11840], 99.99th=[4046848]
   bw (  KiB/s): min=   96, max=131888, per=7.91%, avg=7618.75, stdev=29255.34, samples=20
   iops        : min=   24, max=32972, avg=1904.60, stdev=7313.86, samples=20
  lat (nsec)   : 250=8.61%, 500=88.01%, 750=1.96%, 1000=0.16%
  lat (usec)   : 2=0.31%, 4=0.25%, 10=0.62%, 20=0.06%, 50=0.02%
  lat (msec)   : 10=0.01%
  cpu          : usr=0.14%, sys=0.75%, ctx=90, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19055,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217422: Wed Apr 30 15:14:32 2025
  write: IOPS=998, BW=3993KiB/s (4089kB/s)(39.6MiB/10153msec); 0 zone resets
    slat (nsec): min=1493, max=206974k, avg=987134.68, stdev=11612163.83
    clat (nsec): min=170, max=1637.5k, avg=690.72, stdev=16458.05
     lat (nsec): min=1753, max=206977k, avg=987939.57, stdev=11612469.62
    clat percentiles (nsec):
     |  1.00th=[   191],  5.00th=[   241], 10.00th=[   262], 20.00th=[   310],
     | 30.00th=[   342], 40.00th=[   382], 50.00th=[   410], 60.00th=[   430],
     | 70.00th=[   442], 80.00th=[   450], 90.00th=[   482], 95.00th=[   540],
     | 99.00th=[  3632], 99.50th=[  6624], 99.90th=[ 21376], 99.95th=[ 49408],
     | 99.99th=[193536]
   bw (  KiB/s): min=  352, max=54056, per=4.21%, avg=4049.30, stdev=11791.16, samples=20
   iops        : min=   88, max=13514, avg=1012.20, stdev=2947.82, samples=20
  lat (nsec)   : 250=6.49%, 500=85.72%, 750=4.79%, 1000=0.89%
  lat (usec)   : 2=0.68%, 4=0.45%, 10=0.72%, 20=0.15%, 50=0.06%
  lat (usec)   : 100=0.03%, 250=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=0.17%, sys=0.39%, ctx=110, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10135,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217423: Wed Apr 30 15:14:32 2025
  write: IOPS=1489, BW=5959KiB/s (6102kB/s)(58.8MiB/10109msec); 0 zone resets
    slat (nsec): min=1493, max=410747k, avg=663182.45, stdev=10210407.66
    clat (nsec): min=160, max=27987k, avg=3666.79, stdev=280545.40
     lat (nsec): min=1723, max=410750k, avg=666955.24, stdev=10214259.00
    clat percentiles (nsec):
     |  1.00th=[     201],  5.00th=[     251], 10.00th=[     282],
     | 20.00th=[     330], 30.00th=[     362], 40.00th=[     382],
     | 50.00th=[     402], 60.00th=[     422], 70.00th=[     430],
     | 80.00th=[     442], 90.00th=[     462], 95.00th=[     490],
     | 99.00th=[    2832], 99.50th=[    6304], 99.90th=[   12096],
     | 99.95th=[   29056], 99.99th=[20054016]
   bw (  KiB/s): min=   94, max=98608, per=6.25%, avg=6019.50, stdev=21800.82, samples=20
   iops        : min=   23, max=24652, avg=1504.80, stdev=5450.23, samples=20
  lat (nsec)   : 250=4.93%, 500=90.92%, 750=2.46%, 1000=0.18%
  lat (usec)   : 2=0.26%, 4=0.29%, 10=0.79%, 20=0.09%, 50=0.05%
  lat (usec)   : 100=0.01%
  lat (msec)   : 50=0.01%
  cpu          : usr=0.27%, sys=0.47%, ctx=89, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,15059,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217424: Wed Apr 30 15:14:32 2025
  write: IOPS=1766, BW=7065KiB/s (7234kB/s)(69.3MiB/10041msec); 0 zone resets
    slat (nsec): min=1383, max=207744k, avg=562808.70, stdev=8811641.47
    clat (nsec): min=160, max=40045, avg=435.63, stdev=748.86
     lat (nsec): min=1683, max=207747k, avg=563352.06, stdev=8811836.36
    clat percentiles (nsec):
     |  1.00th=[  181],  5.00th=[  231], 10.00th=[  241], 20.00th=[  270],
     | 30.00th=[  330], 40.00th=[  362], 50.00th=[  390], 60.00th=[  410],
     | 70.00th=[  430], 80.00th=[  442], 90.00th=[  470], 95.00th=[  572],
     | 99.00th=[ 1912], 99.50th=[ 5472], 99.90th=[ 8512], 99.95th=[13632],
     | 99.99th=[37632]
   bw (  KiB/s): min=   79, max=118704, per=7.36%, avg=7088.55, stdev=26280.29, samples=20
   iops        : min=   19, max=29676, avg=1772.00, stdev=6570.11, samples=20
  lat (nsec)   : 250=11.36%, 500=81.15%, 750=4.80%, 1000=1.17%
  lat (usec)   : 2=0.52%, 4=0.38%, 10=0.53%, 20=0.06%, 50=0.02%
  cpu          : usr=0.22%, sys=0.66%, ctx=98, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17734,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217425: Wed Apr 30 15:14:32 2025
  write: IOPS=1030, BW=4123KiB/s (4222kB/s)(40.6MiB/10073msec); 0 zone resets
    slat (nsec): min=1473, max=317634k, avg=958203.39, stdev=11730300.94
    clat (nsec): min=160, max=16022k, avg=2724.89, stdev=165065.57
     lat (nsec): min=1753, max=317637k, avg=961047.48, stdev=11731589.44
    clat percentiles (nsec):
     |  1.00th=[    181],  5.00th=[    231], 10.00th=[    262],
     | 20.00th=[    310], 30.00th=[    342], 40.00th=[    390],
     | 50.00th=[    410], 60.00th=[    430], 70.00th=[    442],
     | 80.00th=[    450], 90.00th=[    470], 95.00th=[    540],
     | 99.00th=[   3888], 99.50th=[   6432], 99.90th=[  15040],
     | 99.95th=[  37120], 99.99th=[3948544]
   bw (  KiB/s): min=  344, max=57816, per=4.31%, avg=4147.05, stdev=12651.99, samples=20
   iops        : min=   86, max=14454, avg=1036.55, stdev=3163.05, samples=20
  lat (nsec)   : 250=8.52%, 500=84.56%, 750=3.79%, 1000=0.91%
  lat (usec)   : 2=0.78%, 4=0.45%, 10=0.82%, 20=0.10%, 50=0.03%
  lat (usec)   : 100=0.02%
  lat (msec)   : 4=0.02%, 20=0.01%
  cpu          : usr=0.12%, sys=0.44%, ctx=109, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10383,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217426: Wed Apr 30 15:14:32 2025
  write: IOPS=1447, BW=5789KiB/s (5928kB/s)(56.9MiB/10061msec); 0 zone resets
    slat (nsec): min=1573, max=204199k, avg=687326.05, stdev=9757765.52
    clat (nsec): min=160, max=65843, avg=452.22, stdev=926.53
     lat (nsec): min=1804, max=204203k, avg=687893.52, stdev=9758152.36
    clat percentiles (nsec):
     |  1.00th=[  201],  5.00th=[  241], 10.00th=[  282], 20.00th=[  330],
     | 30.00th=[  342], 40.00th=[  362], 50.00th=[  402], 60.00th=[  422],
     | 70.00th=[  442], 80.00th=[  450], 90.00th=[  462], 95.00th=[  490],
     | 99.00th=[ 2224], 99.50th=[ 5792], 99.90th=[ 8768], 99.95th=[12864],
     | 99.99th=[45312]
   bw (  KiB/s): min=  392, max=92264, per=6.04%, avg=5817.70, stdev=20355.12, samples=20
   iops        : min=   98, max=23066, avg=1454.30, stdev=5088.81, samples=20
  lat (nsec)   : 250=5.19%, 500=90.56%, 750=2.58%, 1000=0.23%
  lat (usec)   : 2=0.33%, 4=0.36%, 10=0.67%, 20=0.05%, 50=0.02%
  lat (usec)   : 100=0.01%
  cpu          : usr=0.19%, sys=0.53%, ctx=90, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,14560,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
mytest: (groupid=0, jobs=1): err= 0: pid=217427: Wed Apr 30 15:14:32 2025
  write: IOPS=1715, BW=6864KiB/s (7029kB/s)(67.5MiB/10073msec); 0 zone resets
    slat (nsec): min=1322, max=214860k, avg=578827.98, stdev=9117881.76
    clat (nsec): min=160, max=39233, avg=452.33, stdev=848.74
     lat (nsec): min=1553, max=214862k, avg=579390.82, stdev=9118077.46
    clat percentiles (nsec):
     |  1.00th=[  191],  5.00th=[  241], 10.00th=[  251], 20.00th=[  290],
     | 30.00th=[  322], 40.00th=[  382], 50.00th=[  410], 60.00th=[  422],
     | 70.00th=[  430], 80.00th=[  450], 90.00th=[  470], 95.00th=[  580],
     | 99.00th=[ 1928], 99.50th=[ 5920], 99.90th=[11584], 99.95th=[14784],
     | 99.99th=[36608]
   bw (  KiB/s): min=  275, max=120688, per=7.18%, avg=6911.05, stdev=26785.29, samples=20
   iops        : min=   68, max=30172, avg=1727.55, stdev=6696.37, samples=20
  lat (nsec)   : 250=6.90%, 500=85.28%, 750=5.14%, 1000=1.16%
  lat (usec)   : 2=0.54%, 4=0.28%, 10=0.58%, 20=0.09%, 50=0.03%
  cpu          : usr=0.18%, sys=0.68%, ctx=90, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17285,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=94.0MiB/s (98.6MB/s), 3724KiB/s-9475KiB/s (3813kB/s-9702kB/s), io=955MiB (1001MB), run=10037-10157msec

Disk stats (read/write):
  sda: ios=40/45989, merge=9/13866, ticks=23/21623, in_queue=14676, util=97.12%
--- IOZone shared filesystem test ---
	Iozone: Performance Test of File I/O
	        Version $Revision: 3.489 $
		Compiled for 64 bit mode.
		Build: linux-AMD64 

	Contributors:William Norcott, Don Capps, Isom Crawford, Kirby Collins
	             Al Slater, Scott Rhine, Mike Wisner, Ken Goss
	             Steve Landherr, Brad Smith, Mark Kelly, Dr. Alain CYR,
	             Randy Dunlap, Mark Montague, Dan Million, Gavin Brebner,
	             Jean-Marc Zucconi, Jeff Blomberg, Benny Halevy, Dave Boone,
	             Erik Habbinga, Kris Strecker, Walter Wong, Joshua Root,
	             Fabrice Bacchella, Zhenghua Xue, Qin Li, Darren Sawyer,
	             Vangel Bojaxhi, Ben England, Vikentsi Lapa,
	             Alexey Skidanov, Sudhir Kumar.

	Run began: Wed Apr 30 15:14:32 2025

	Auto Mode
	Command line used: iozone -a
	Output is in kBytes/sec
	Time Resolution = 0.000001 seconds.
	Processor cache size set to 1024 kBytes.
	Processor cache line size set to 32 bytes.
	File stride size set to 17 * record size.
                                                              random    random     bkwd    record    stride                                    
              kB  reclen    write  rewrite    read    reread    read     write     read   rewrite      read   fwrite frewrite    fread  freread
              64       4
Can not open temp file: iozone.tmp
open: Permission denied

--- FIO shared I/O test ---
mytest: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.16
Starting 16 processes
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied
mytest: Laying out IO file (1 file / 1024MiB)
fio: pid=0, err=13/file:filesetup.c:162, func=open, error=Permission denied


Run status group 0 (all jobs):